app/views/sessions/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "marios knl"], ["LIMIT", 1]]
---
        <strong>
          <%= link_to "#{user.name.upcase} (#{user.events.count})",
              sessions_path("user" => { "name" => user.name }),
              method: :post,
              class: "nav-link d-inline-block btn btn-warning m-2 text-danger" %>