app/views/events/index.html.erb

SELECT "events".* FROM "events" WHERE (date < '2020-05-21 09:37:22.006039')
---
    <tbody>
      <% current_user.attended_events.upcoming_events.each do |event| %>