app/helpers/application_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def welcome_links
    @user = User.find(@current_user_id).name.upcase unless session[:current_user_id].nil?