app/helpers/sessions_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def current_user
    User.find(current_user_id) if signed_in?