app/controllers/application_controller.rb

  def current_user
    @current_user_id = session[:current_user_id]
    @current_user = User.find(@current_user_id) if @current_user_id
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]