app/controllers/events_controller.rb

  def index
    @events = Event.all.order('created_at DESC')
---
SELECT "events".* FROM "events" ORDER BY created_at DESC

  def new
    @event = User.find(@current_user_id).events.build
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def create
    @event = User.find(@current_user_id).events.build(event_params)

    if @event.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
INSERT INTO "events" ("date", "location", "created_at", "updated_at", "creator_id", "description") VALUES (?, ?, ?, ?, ?, ?)

  def invite_creator
    Invitation.create(
      attendee_id: @current_user.id,
      attended_event_id: @event.id
    )
---
INSERT INTO "invitations" ("attendee_id", "attended_event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["attendee_id", 2], ["attended_event_id", 15], ["created_at", "2020-05-23 08:37:47.370126"], ["updated_at", "2020-05-23 08:37:47.370126"]]