app/controllers/invitations_controller.rb

  def create
    @invitation = Invitation(attendee_id, attended_event_id).build
  end
end

@event = User.find(@current_user_id).events.build(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]