app/controllers/invitations_controller.rb

  def create
    @event_id = params[:information][:event_id]
    @user = User.find(params[:information][:unattendee_id])

    invitation = @user.invitations.build(attended_event_id: @event_id)

    redirect_to event_path(@event_id) if invitation.save
---
INSERT INTO "invitations" ("attendee_id", "attended_event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["attendee_id", 3], ["attended_event_id", 14], ["created_at", "2020-05-21 13:30:15.750253"], ["updated_at", "2020-05-21 13:30:15.750253"]]