app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC
---
  def new
    @names = User.all

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "marios"], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC
---
  def create
    @name = params[:user][:name]
    @user = User.new(name: @name)
    if User.find_by(name: @name).nil?
      @names = User.all