app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
      @user = User.find_by(name: @user.name)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Chrome"], ["created_at", "2020-05-21 12:36:13.752983"], ["updated_at", "2020-05-21 12:36:13.752983"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Keyboard"], ["LIMIT", 1]]

  def show
    @user = User.find(current_user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]