app/models/event.rb

  def unattendees
    User.all - attendees
---
SELECT "users".* FROM "users"