app/views/layouts/application.html.erb

  <body>
  <h1>Welcome  <%= User.find(@current_user_id).name.upcase unless session[:current_user_id].nil? %>! </h1>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]